---
kind: method
id: M:Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelOptions.#ctor(System.Double)
source: html/ff2d6432-d624-692e-eb82-dcc98801b3b6.htm
---
# Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelOptions.#ctor Method

Creates an object with default values.

## Syntax (C#)
```csharp
public AlignmentStationLabelOptions(
	double station
)
```

## Parameters
- **station** (`System.Double`) - The station at which the label will be placed.